# PANDAS 3

 We will be adding columns, deleting columns, and slicing the data many different ways.

In [1]:
# Import libraries
import pandas as pd
import sys

In [2]:
print('Python version ' + sys.version)
print('Pandas version: ' + pd.__version__)

Python version 3.7.3 (default, Mar 27 2019, 17:13:21) [MSC v.1915 64 bit (AMD64)]
Pandas version: 0.24.2

In [3]:
# Our small data set
col1 = [100,200]

col2 = ["M","F"]
col3 = ["bala","lisa"]

data = {
    "c1": col1,
    "c2": col2,
    "c3": col3
}

# data = list(zip(col1,col2))

# Create dataframe
df = pd.DataFrame(data)
df.columns = ["col1", "col2", "col3"]
df

   col1 col2  col3
0   100    M  bala
1   200    F  lisa

In [4]:
# Lets change the name of the column
def myfunction(x):
    if x == "M":
        return "Male"
    else:
        return "Female"  
    
    
df["col2_full"] = df.col2.apply(myfunction)

print(df)



del df["col2_full"]
print(df)

   col1 col2  col3 col2_full
0   100    M  bala      Male
1   200    F  lisa    Female
   col1 col2  col3
0   100    M  bala
1   200    F  lisa

In [5]:
# add a column
df['NewCol'] = 5
df

   col1 col2  col3  NewCol
0   100    M  bala       5
1   200    F  lisa       5

In [6]:
del df["NewCol"]

In [7]:
df

   col1 col2  col3
0   100    M  bala
1   200    F  lisa

In [8]:
df

   col1 col2  col3
0   100    M  bala
1   200    F  lisa

In [9]:
df

   col1 col2  col3
0   100    M  bala
1   200    F  lisa

In [10]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [11]:
# If we wanted, we could change the name of the index
i = ['a','b']
df.index = i
df.columns = ["col1","col2","col3"]
df

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

In [12]:
df.iloc[ -2:, : ]

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

We can now start to select pieces of the dataframe using ***loc***.

In [13]:
df.loc['a']

col1     100
col2       M
col3    bala
Name: a, dtype: object

In [14]:
# df.loc[inclusive:inclusive]
df.loc['a':'d']

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

In [15]:
# df.iloc[inclusive:exclusive]
# Note: .iloc is strictly integer position based. It is available from [version 0.11.0] (http://pandas.pydata.org/pandas-docs/stable/whatsnew.html#v0-11-0-april-22-2013) 
df.iloc[-2:]

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

We can also select using the column name.

In [16]:
df

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

In [17]:
df[['col1', 'col1']]

   col1  col1
a   100   100
b   200   200

In [18]:
df['col1']

a    100
b    200
Name: col1, dtype: int64

In [19]:
df[['col1','col3']]

   col1  col3
a   100  bala
b   200  lisa

There is also some handy function to select the top and bottom records of a dataframe.

In [20]:
# Select top N number of records (default = 5)
df.head()

   col1 col2  col3
a   100    M  bala
b   200    F  lisa

In [21]:
# Select bottom N number of records (default = 5)
df.tail()

   col1 col2  col3
a   100    M  bala
b   200    F  lisa